//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
// **************************************************************
//                  http://www.icocos.cn                       //
//                 https://icocos.github.io                    //
//                https://al1020119.github.io                  //
// **************************************************************
//  ************  😂🤔 曹理鹏(梦工厂@iCocos) 🤔😂  ************  //
// **************************************************************
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
// **************************************************************
//
//  Single_App
//  ApiMacros.swift
//
//  Created by iCocos on 2018/12/23.
//  Copyright © 2018年 iCocos. All rights reserved.
//
// @class ApiMacros.swift
// @abstract Api宏
// @discussion 实现基本的Api宏操作与服务
//
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
// **************************************************************

import Foundation

// 域名
let kDomain         =   "japi.juhe.cn"
// 请求的根url
let kBase_url       =   "https://japi.juhe.cn/"
// 请求的key（暂时需要）
let kRequest_key  =   "b13defd332c76c3abf2895f7796e2a45"
