//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
// **************************************************************
//                  http://www.icocos.cn                       //
//                 https://icocos.github.io                    //
//                https://al1020119.github.io                  //
// **************************************************************
//  ************  😂🤔 曹理鹏(梦工厂@iCocos) 🤔😂  ************  //
// **************************************************************
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
// **************************************************************
//
//  Single_App
//  AppConfig
//
//  Created by iCocos on 2018/12/21.
//  Copyright © 2018年 iCocos. All rights reserved.
//
// @class AppConfig.swift
// @abstract App配置
// @discussion App接口，打印，UI配置
//
//░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
// **************************************************************

import UIKit

///正式环境与测试环境切换(默认每次打开都是正式环境)
func developer_api()->Bool{return true}


/// 启动配置
let is_launching_config = true


/// 调试模式
let is_debug = true


/// 开始全局调试模式
///1. 打印
///2. 支付清空
///3. UI控制
///4. 逻辑调试
///5. 预优化
///6. 测试模式
///7. 内部包
let is_debug_developer_status = true


enum CarrierType {
    case Phone
    case WLAN
}

/// App配置工具
public class AppConfig {

    
}
